{
	"Recipes":
	[
		{"RecipeName":"Pancakes","RecipeImage":"https://raw.githubusercontent.com/vksam123/SamsIT315RecipeProject/master/pancake.jpg","PrepTime":"5 min","CookTime":"15 min","TotalTime":"20 min","Servings":"8","ServingTime":"Breakfast","Ingredients":"Flour, Baking Powder, Sugar, Salt, Milk, Butter, Eggs","Directions":"1.Sift the dry ingredients together. 2.Make a well, then add the wet ingredients. Stir to combine. 3.Scoop the batter onto a hot griddle or pan. 4.Cook for two to three minutes, then flip. 5.Continue cooking until brown on both sides."},
		{"RecipeName":"French Toast","RecipeImage":"https://raw.githubusercontent.com/vksam123/SamsIT315RecipeProject/master/ftoast.jpg","PrepTime":"5 min","CookTime":"10 min","TotalTime":"15 min","Servings":"3","ServingTime":"Breakfast","Ingredients":"White Bread, Eggs, Milk, Vanilla, Cinnamon, Butter","Directions":"1. Whisk milk, eggs, vanilla, cinnamon, and salt together in a shallow bowl. 2.Lightly butter a griddle and heat over medium-high heat. 3.Dunk bread in the egg mixture, soaking both sides. Transfer to the hot skillet and cook until golden, 3 to 4 minutes per side. Serve hot."},
		{"RecipeName":"Crêpes","RecipeImage":"https://raw.githubusercontent.com/vksam123/SamsIT315RecipeProject/master/crepes.jpg","PrepTime":"10 min","CookTime":"20 min","TotalTime":"30 min","Servings":"4","ServingTime":"Breakfast","Ingredients":"Flour, Eggs, Milk, Water, Salt, Butter","Directions":"1.Whisk the flour and eggs. 2.Gradually add the milk and water. 3.Scoop the batter onto a hot griddle. 4.Cook until lightly browned on the bottom. 5.Flip and continue cooking until done on both sides."},
		
		{"RecipeName":"Pasta Salad","RecipeImage":"https://raw.githubusercontent.com/vksam123/SamsIT315RecipeProject/master/pastasalad.jpg","PrepTime":"20 min","CookTime":"10 min","TotalTime":"30 min","Servings":"6","ServingTime":"Lunch","Ingredients":"1 pound tri-colored spiral pasta, 1 (16 ounce) bottle Italian-style salad dressing, 6 tablespoons salad seasoning mix, 2 cups cherry tomatoes, diced, 1 green bell pepper, chopped, 1 red bell pepper, diced, ½ yellow bell pepper, chopped, 1 (2.25 ounce) can black olives, chopped","Directions":"1.Bring a large pot of lightly salted water to a boil. Cook pasta in the boiling water, stirring occasionally, until tender yet firm to the bite, about 10 to 12 minutes; rinse under cold water and drain. 2.Whisk Italian dressing and salad spice mix together until smooth. 3.Combine pasta, tomatoes, bell peppers, and olives in a salad bowl; pour dressing over salad and toss to coat. Refrigerate salad, 8 hours to overnight."},
		{"RecipeName":"Reuben Sandwich","RecipeImage":"https://raw.githubusercontent.com/vksam123/SamsIT315RecipeProject/master/reuben.jpg","PrepTime":"10 min","CookTime":"10 min","TotalTime":"20 min","Servings":"4","ServingTime":"Lunch","Ingredients":"8 slices rye bread, ½ cup Thousand Island dressing, 8 slices Swiss cheese, 8 slices deli sliced corned beef, 1 cup sauerkraut, drained, 2 tablespoons butter, softened","Directions":"1.Spread the dressing on one side of each slice of bread. 2.Assemble the sandwiches. Butter the top of each sandwich. 3.Place the sandwich butter-side down on the hot skillet or griddle. 4.Butter the other side. Flip when the bottom slice is golden brown. 5.Grill until both sides are golden brown."},
		
		{"RecipeName":"Chicken Parmesan","RecipeImage":"https://raw.githubusercontent.com/vksam123/SamsIT315RecipeProject/master/ChickenParm.jpg","PrepTime":"15 min","CookTime":"20 min","TotalTime":"35 min","Servings":"4","ServingTime":"Dinner","Ingredients":"4 Chicken Breast Halves, Salt, Ground Pepper, 2 Large Eggs, 1 Cup Bread Crumbs, ¾ Grated Parmesan Cheese, 2 Tablespoons Flour, ½ Cup Olive Oil, ½ Cup Tomato Sauce, ¼ Cup Mozzarella","Directions":"1.Preheat an oven to 450 degrees F (230 degrees C)2.Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper.3.Beat eggs in a shallow bowl and set aside.4.Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside.5.Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides.6.Dip a flour-coated chicken breast in beaten eggs. Transfer breast to the bread crumb mixture, pressing crumbs into both sides. Repeat for each breast. Let chicken rest for 10 to 15 minutes.7.Heat 1/2 inch olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken in the hot oil until golden, about 2 minutes per side. The chicken will finish cooking in the oven.8.Transfer chicken to a baking dish. Top each breast with 2 tablespoons tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle remaining Parmesan over top and drizzle each with 1/2 teaspoon olive oil.9.Bake in the preheated oven until cheese is browned and bubbly and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."}
	],
	"Status":"OK"
}
